cask_args appdir: "/Applications",
          fontdir: "/Library/Fonts",
          input_methoddir: "/Library/Input Methods",
          prefpanedir: "/Library/PreferencePanes",
          screen_saverdir: "/Library/Screen Savers"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "adoptopenjdk/openjdk"
tap "bats-core/bats-core"
tap "go-task/tap"

# https://docs.brew.sh/Versions.html
# https://github.com/mathiasbynens/dotfiles/blob/master/brew.sh#L52
# 
# brew "asciinema"
brew "asdf"
brew "awscli"
brew "bash"
brew "bats-core"
brew "bats-support"
brew "bats-assert"
brew "bats-file"
brew "bats-detik"
brew "black"
# brew "ccat"
brew "chruby"
# brew "cmake"
brew "colima"
# brew "desk"
# brew "direnv"
brew "docker"
brew "flake8"
brew "git"
# brew "git-extras"
# brew "git-flow"
# brew "gnupg"
brew "go"
brew "golangci-lint"
brew "go-task"
brew "hadolint"
brew "helm"
# brew "httpie"
# brew "jenv"
brew "jq"
brew "kind"
brew "kops"
brew "kubernetes-cli"
brew "mas"
brew "mercurial"
brew "minikube"
brew "neovim"
# brew "ngrep"
brew "nvm"
brew "pipenv"
brew "pipx"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint"
# brew "reattach-to-user-namespace"
brew "ruby-install"
# brew "rust"
# brew "screen"
brew "skaffold"
brew "stern"
# brew "tfenv"
brew "tig"
brew "tmux"
# brew "tree"
brew "vim"
brew "watch"
brew "zsh"

# cask "adium"
# cask "alfred"
# cask "appcleaner"
# cask "atom"
# cask "bartender"
# cask "brave-browser"
# cask "charles"
# cask "dash"
# cask "disk-drill"
# cask "docker"
cask "dropbox"
cask "firefox"
# cask "google-chrome"
# cask "insomnia"
# cask "intellij-idea-ce"
cask "iterm2"
# cask "java"
# cask "java8"
# cask "launchcontrol"
cask "libreoffice"
cask "macdown"
# cask "marp"
# cask "muzzle"
cask "notion"
cask "onedrive"
# cask "openemu"
# cask "openoffice"
# cask "opera"
# cask "plex-media-server"
cask "rowanj-gitx"
# cask "sequel-pro"
cask "skype"
cask "slack"
# cask "sourcetree"
cask "spotify"
# cask "steam"
cask "sublime-merge"
cask "sublime-text"
# cask "time-sink"
# cask "tower"
# cask "transmit"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
# cask "viscosity"
cask "visual-studio-code"
cask "vlc"
# cask "wireshark"
cask "zoom"

# TODO
# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command#L587
# https://github.com/bkuhlmann/mac_os-config/blob/master/bin/install_app_store
# mas "Amphetamine", id: 937984704
# mas "Coffitivity", id: 659901392
# mas "Evernote", id: 406056744
# mas "Xcode", id: 497799835
