# TODO
# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command#L472
cask_args appdir: "/Applications",
          fontdir: "/Library/Fonts",
          input_methoddir: "/Library/Input Methods",
          prefpanedir: "/Library/PreferencePanes",
          screen_saverdir: "/Library/Screen Savers"

tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"

# https://docs.brew.sh/Versions.html
# https://github.com/mathiasbynens/dotfiles/blob/master/brew.sh#L52
# 
# brew "asciinema"
brew "awscli"
# brew "ccat"
# brew "chruby"
# brew "desk"
# brew "direnv"
brew "git"
# brew "git-extras"
brew "git-flow"
# TODO
# http://tammersaleh.com/posts/manage-your-gopath-with-direnv/
# https://github.com/direnv/direnv/wiki/golang
# http://rachbelaid.com/handling-go-workspace-with-direnv/
# https://github.com/direnv/direnv
# https://direnv.net/
# https://www.reddit.com/r/golang/comments/40ps8k/really_wrestling_with_gopath/
# http://sourabhbajaj.com/mac-setup/Go/README.html
# https://stackoverflow.com/questions/21499337/cannot-set-gopath-on-mac-osx
# https://medium.com/@AkyunaAkish/setting-up-a-golang-development-environment-mac-os-x-d58e5a7ea24f
brew "go"
# brew "heroku-toolbelt"
brew "htop"
brew "httpie"
# brew "hub"
# brew "jenv"
# brew "jq"
brew "mas"
brew "mercurial"
# brew "ngrep"
# brew "reattach-to-user-namespace"
# brew "ruby-install"
# brew "rust"
# brew "screen"
# brew "terraform"
# brew "tig"
# brew "tmux"
# brew "tree"
# brew "vim" # --with-override-system-vi
brew "zplug"
brew "zsh"

# cask "adium"
# cask "alfred"
# cask "appcleaner"
cask "atom"
# cask "bartender"
# cask "charles"
# cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "iterm2"
cask "java"
# cask "launchcontrol"
cask "macdown"
# cask "marp"
# cask "plex-media-server"
cask "rowanj-gitx"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
# cask "steam"
cask "sublime-text"
# cask "time-sink"
# cask "tower"
cask "vagrant"
cask "virtualbox"
cask "vlc"
# cask "wireshark"

# TODO
# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command#L587
# https://github.com/bkuhlmann/mac_os-config/blob/master/bin/install_app_store
# mas "Amphetamine", id: 937984704
# mas "Coffitivity", id: 659901392
mas "Evernote", id: 406056744
# mas "Xcode", id: 497799835
