cask_args appdir: "/Applications",
          fontdir: "/Library/Fonts",
          input_methoddir: "/Library/Input Methods",
          prefpanedir: "/Library/PreferencePanes",
          screen_saverdir: "/Library/Screen Savers"

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# https://docs.brew.sh/Versions.html
# https://github.com/mathiasbynens/dotfiles/blob/master/brew.sh#L52
# 
# brew "asciinema"
brew "awscli"
# brew "ccat"
brew "chruby"
brew "cmake"
brew "dep"
# brew "desk"
# brew "direnv"
brew "git"
# brew "git-extras"
brew "git-flow"
brew "go"
# brew "heroku-toolbelt"
brew "httpie"
# brew "hub"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "mercurial"
# brew "ngrep"
# brew "reattach-to-user-namespace"
brew "ruby-install"
# brew "rust"
# brew "screen"
brew "skaffold"
brew "terraform"
# brew "tig"
# brew "tmux"
# brew "tree"
# brew "vim" # --with-override-system-vi
brew "zplug"
brew "zsh"

# cask "adium"
# cask "alfred"
# cask "appcleaner"
cask "atom"
# cask "bartender"
# cask "charles"
# cask "dash"
# cask "disk-drill"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "java8"
# cask "launchcontrol"
cask "libreoffice"
cask "macdown"
# cask "marp"
cask "minikube"
# cask "muzzle"
cask "onedrive"
# cask "openemu"
# cask "openoffice"
# cask "opera"
# cask "plex-media-server"
cask "rowanj-gitx"
cask "sequel-pro"
cask "skype"
cask "slack"
# cask "sourcetree"
cask "spotify"
# cask "steam"
cask "sublime-text"
# cask "time-sink"
# cask "tower"
# cask "transmit"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
# cask "viscosity"
cask "visual-studio-code"
cask "vlc"
# cask "wireshark"
cask "zoomus"

# TODO
# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command#L587
# https://github.com/bkuhlmann/mac_os-config/blob/master/bin/install_app_store
# mas "Amphetamine", id: 937984704
# mas "Coffitivity", id: 659901392
mas "Evernote", id: 406056744
# mas "Xcode", id: 497799835
